7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_DSI.h
#define Get_DSI_DSI_VR(FLAG)                 (*(uint32_t*)0x40016c00 |= FLAG)
#define Get_DSI_DSI_CR(FLAG)                 (*(uint32_t*)0x40016c04 |= FLAG)
#define Get_DSI_DSI_CCR(FLAG)                (*(uint32_t*)0x40016c08 |= FLAG)
#define Get_DSI_DSI_LVCIDR(FLAG)             (*(uint32_t*)0x40016c0c |= FLAG)
#define Get_DSI_DSI_LCOLCR(FLAG)             (*(uint32_t*)0x40016c10 |= FLAG)
#define Get_DSI_DSI_LPCR(FLAG)               (*(uint32_t*)0x40016c14 |= FLAG)
#define Get_DSI_DSI_LPMCR(FLAG)              (*(uint32_t*)0x40016c18 |= FLAG)
#define Get_DSI_DSI_PCR(FLAG)                (*(uint32_t*)0x40016c2c |= FLAG)
#define Get_DSI_DSI_GVCIDR(FLAG)             (*(uint32_t*)0x40016c30 |= FLAG)
#define Get_DSI_DSI_MCR(FLAG)                (*(uint32_t*)0x40016c34 |= FLAG)
#define Get_DSI_DSI_VMCR(FLAG)               (*(uint32_t*)0x40016c38 |= FLAG)
#define Get_DSI_DSI_VPCR(FLAG)               (*(uint32_t*)0x40016c3c |= FLAG)
#define Get_DSI_DSI_VCCR(FLAG)               (*(uint32_t*)0x40016c40 |= FLAG)
#define Get_DSI_DSI_VNPCR(FLAG)              (*(uint32_t*)0x40016c44 |= FLAG)
#define Get_DSI_DSI_VHSACR(FLAG)             (*(uint32_t*)0x40016c48 |= FLAG)
#define Get_DSI_DSI_VHBPCR(FLAG)             (*(uint32_t*)0x40016c4c |= FLAG)
#define Get_DSI_DSI_VLCR(FLAG)               (*(uint32_t*)0x40016c50 |= FLAG)
#define Get_DSI_DSI_VVSACR(FLAG)             (*(uint32_t*)0x40016c54 |= FLAG)
#define Get_DSI_DSI_VVBPCR(FLAG)             (*(uint32_t*)0x40016c58 |= FLAG)
#define Get_DSI_DSI_VVFPCR(FLAG)             (*(uint32_t*)0x40016c5c |= FLAG)
#define Get_DSI_DSI_VVACR(FLAG)              (*(uint32_t*)0x40016c60 |= FLAG)
#define Get_DSI_DSI_LCCR(FLAG)               (*(uint32_t*)0x40016c64 |= FLAG)
#define Get_DSI_DSI_CMCR(FLAG)               (*(uint32_t*)0x40016c68 |= FLAG)
#define Get_DSI_DSI_GHCR(FLAG)               (*(uint32_t*)0x40016c6c |= FLAG)
#define Get_DSI_DSI_GPDR(FLAG)               (*(uint32_t*)0x40016c70 |= FLAG)
#define Get_DSI_DSI_GPSR(FLAG)               (*(uint32_t*)0x40016c74 |= FLAG)
#define Get_DSI_DSI_TCCR0(FLAG)              (*(uint32_t*)0x40016c78 |= FLAG)
#define Get_DSI_DSI_TCCR1(FLAG)              (*(uint32_t*)0x40016c7c |= FLAG)
#define Get_DSI_DSI_TCCR2(FLAG)              (*(uint32_t*)0x40016c80 |= FLAG)
#define Get_DSI_DSI_TCCR3(FLAG)              (*(uint32_t*)0x40016c84 |= FLAG)
#define Get_DSI_DSI_TCCR4(FLAG)              (*(uint32_t*)0x40016c88 |= FLAG)
#define Get_DSI_DSI_TCCR5(FLAG)              (*(uint32_t*)0x40016c8c |= FLAG)
#define Get_DSI_DSI_CLCR(FLAG)               (*(uint32_t*)0x40016c94 |= FLAG)
#define Get_DSI_DSI_CLTCR(FLAG)              (*(uint32_t*)0x40016c98 |= FLAG)
#define Get_DSI_DSI_DLTCR(FLAG)              (*(uint32_t*)0x40016c9c |= FLAG)
#define Get_DSI_DSI_PCTLR(FLAG)              (*(uint32_t*)0x40016ca0 |= FLAG)
#define Get_DSI_DSI_PCONFR(FLAG)             (*(uint32_t*)0x40016ca4 |= FLAG)
#define Get_DSI_DSI_PUCR(FLAG)               (*(uint32_t*)0x40016ca8 |= FLAG)
#define Get_DSI_DSI_PTTCR(FLAG)              (*(uint32_t*)0x40016cac |= FLAG)
#define Get_DSI_DSI_PSR(FLAG)                (*(uint32_t*)0x40016cb0 |= FLAG)
#define Get_DSI_DSI_ISR0(FLAG)               (*(uint32_t*)0x40016cbc |= FLAG)
#define Get_DSI_DSI_ISR1(FLAG)               (*(uint32_t*)0x40016cc0 |= FLAG)
#define Get_DSI_DSI_IER0(FLAG)               (*(uint32_t*)0x40016cc4 |= FLAG)
#define Get_DSI_DSI_IER1(FLAG)               (*(uint32_t*)0x40016cc8 |= FLAG)
#define Get_DSI_DSI_FIR0(FLAG)               (*(uint32_t*)0x40016cd8 |= FLAG)
#define Get_DSI_DSI_FIR1(FLAG)               (*(uint32_t*)0x40016cdc |= FLAG)
#define Get_DSI_DSI_VSCR(FLAG)               (*(uint32_t*)0x40016d00 |= FLAG)
#define Get_DSI_DSI_LCVCIDR(FLAG)            (*(uint32_t*)0x40016d0c |= FLAG)
#define Get_DSI_DSI_LCCCR(FLAG)              (*(uint32_t*)0x40016d10 |= FLAG)
#define Get_DSI_DSI_LPMCCR(FLAG)             (*(uint32_t*)0x40016d18 |= FLAG)
#define Get_DSI_DSI_VMCCR(FLAG)              (*(uint32_t*)0x40016d38 |= FLAG)
#define Get_DSI_DSI_VPCCR(FLAG)              (*(uint32_t*)0x40016d3c |= FLAG)
#define Get_DSI_DSI_VCCCR(FLAG)              (*(uint32_t*)0x40016d40 |= FLAG)
#define Get_DSI_DSI_VNPCCR(FLAG)             (*(uint32_t*)0x40016d44 |= FLAG)
#define Get_DSI_DSI_VHSACCR(FLAG)            (*(uint32_t*)0x40016d48 |= FLAG)
#define Get_DSI_DSI_VHBPCCR(FLAG)            (*(uint32_t*)0x40016d4c |= FLAG)
#define Get_DSI_DSI_VLCCR(FLAG)              (*(uint32_t*)0x40016d50 |= FLAG)
#define Get_DSI_DSI_VVSACCR(FLAG)            (*(uint32_t*)0x40016d54 |= FLAG)
#define Get_DSI_DSI_VVBPCCR(FLAG)            (*(uint32_t*)0x40016d58 |= FLAG)
#define Get_DSI_DSI_VVFPCCR(FLAG)            (*(uint32_t*)0x40016d5c |= FLAG)
#define Get_DSI_DSI_VVACCR(FLAG)             (*(uint32_t*)0x40016d60 |= FLAG)
#define Get_DSI_DSI_WCFGR(FLAG)              (*(uint32_t*)0x40017000 |= FLAG)
#define Get_DSI_DSI_WCR(FLAG)                (*(uint32_t*)0x40017004 |= FLAG)
#define Get_DSI_DSI_WIER(FLAG)               (*(uint32_t*)0x40017008 |= FLAG)
#define Get_DSI_DSI_WISR(FLAG)               (*(uint32_t*)0x4001700c |= FLAG)
#define Get_DSI_DSI_WIFCR(FLAG)              (*(uint32_t*)0x40017010 |= FLAG)
#define Get_DSI_DSI_WPCR1(FLAG)              (*(uint32_t*)0x40017018 |= FLAG)
#define Get_DSI_DSI_WPCR2(FLAG)              (*(uint32_t*)0x4001701c |= FLAG)
#define Get_DSI_DSI_WPCR3(FLAG)              (*(uint32_t*)0x40017020 |= FLAG)
#define Get_DSI_DSI_WPCR4(FLAG)              (*(uint32_t*)0x40017024 |= FLAG)
#define Get_DSI_DSI_WPCR5(FLAG)              (*(uint32_t*)0x40017028 |= FLAG)
#define Get_DSI_DSI_WRPCR(FLAG)              (*(uint32_t*)0x40017030 |= FLAG)
#define Set_DSI_DSI_VR(FLAG)                 (*(uint32_t*)0x40016c00 &= FLAG)
#define Clr_DSI_DSI_VR(FLAG)                 (*(uint32_t*)0x40016c00 |= ~FLAG)
#define Set_DSI_DSI_CR(FLAG)                 (*(uint32_t*)0x40016c04 &= FLAG)
#define Clr_DSI_DSI_CR(FLAG)                 (*(uint32_t*)0x40016c04 |= ~FLAG)
#define Set_DSI_DSI_CCR(FLAG)                (*(uint32_t*)0x40016c08 &= FLAG)
#define Clr_DSI_DSI_CCR(FLAG)                (*(uint32_t*)0x40016c08 |= ~FLAG)
#define Set_DSI_DSI_LVCIDR(FLAG)             (*(uint32_t*)0x40016c0c &= FLAG)
#define Clr_DSI_DSI_LVCIDR(FLAG)             (*(uint32_t*)0x40016c0c |= ~FLAG)
#define Set_DSI_DSI_LCOLCR(FLAG)             (*(uint32_t*)0x40016c10 &= FLAG)
#define Clr_DSI_DSI_LCOLCR(FLAG)             (*(uint32_t*)0x40016c10 |= ~FLAG)
#define Set_DSI_DSI_LPCR(FLAG)               (*(uint32_t*)0x40016c14 &= FLAG)
#define Clr_DSI_DSI_LPCR(FLAG)               (*(uint32_t*)0x40016c14 |= ~FLAG)
#define Set_DSI_DSI_LPMCR(FLAG)              (*(uint32_t*)0x40016c18 &= FLAG)
#define Clr_DSI_DSI_LPMCR(FLAG)              (*(uint32_t*)0x40016c18 |= ~FLAG)
#define Set_DSI_DSI_PCR(FLAG)                (*(uint32_t*)0x40016c2c &= FLAG)
#define Clr_DSI_DSI_PCR(FLAG)                (*(uint32_t*)0x40016c2c |= ~FLAG)
#define Set_DSI_DSI_GVCIDR(FLAG)             (*(uint32_t*)0x40016c30 &= FLAG)
#define Clr_DSI_DSI_GVCIDR(FLAG)             (*(uint32_t*)0x40016c30 |= ~FLAG)
#define Set_DSI_DSI_MCR(FLAG)                (*(uint32_t*)0x40016c34 &= FLAG)
#define Clr_DSI_DSI_MCR(FLAG)                (*(uint32_t*)0x40016c34 |= ~FLAG)
#define Set_DSI_DSI_VMCR(FLAG)               (*(uint32_t*)0x40016c38 &= FLAG)
#define Clr_DSI_DSI_VMCR(FLAG)               (*(uint32_t*)0x40016c38 |= ~FLAG)
#define Set_DSI_DSI_VPCR(FLAG)               (*(uint32_t*)0x40016c3c &= FLAG)
#define Clr_DSI_DSI_VPCR(FLAG)               (*(uint32_t*)0x40016c3c |= ~FLAG)
#define Set_DSI_DSI_VCCR(FLAG)               (*(uint32_t*)0x40016c40 &= FLAG)
#define Clr_DSI_DSI_VCCR(FLAG)               (*(uint32_t*)0x40016c40 |= ~FLAG)
#define Set_DSI_DSI_VNPCR(FLAG)              (*(uint32_t*)0x40016c44 &= FLAG)
#define Clr_DSI_DSI_VNPCR(FLAG)              (*(uint32_t*)0x40016c44 |= ~FLAG)
#define Set_DSI_DSI_VHSACR(FLAG)             (*(uint32_t*)0x40016c48 &= FLAG)
#define Clr_DSI_DSI_VHSACR(FLAG)             (*(uint32_t*)0x40016c48 |= ~FLAG)
#define Set_DSI_DSI_VHBPCR(FLAG)             (*(uint32_t*)0x40016c4c &= FLAG)
#define Clr_DSI_DSI_VHBPCR(FLAG)             (*(uint32_t*)0x40016c4c |= ~FLAG)
#define Set_DSI_DSI_VLCR(FLAG)               (*(uint32_t*)0x40016c50 &= FLAG)
#define Clr_DSI_DSI_VLCR(FLAG)               (*(uint32_t*)0x40016c50 |= ~FLAG)
#define Set_DSI_DSI_VVSACR(FLAG)             (*(uint32_t*)0x40016c54 &= FLAG)
#define Clr_DSI_DSI_VVSACR(FLAG)             (*(uint32_t*)0x40016c54 |= ~FLAG)
#define Set_DSI_DSI_VVBPCR(FLAG)             (*(uint32_t*)0x40016c58 &= FLAG)
#define Clr_DSI_DSI_VVBPCR(FLAG)             (*(uint32_t*)0x40016c58 |= ~FLAG)
#define Set_DSI_DSI_VVFPCR(FLAG)             (*(uint32_t*)0x40016c5c &= FLAG)
#define Clr_DSI_DSI_VVFPCR(FLAG)             (*(uint32_t*)0x40016c5c |= ~FLAG)
#define Set_DSI_DSI_VVACR(FLAG)              (*(uint32_t*)0x40016c60 &= FLAG)
#define Clr_DSI_DSI_VVACR(FLAG)              (*(uint32_t*)0x40016c60 |= ~FLAG)
#define Set_DSI_DSI_LCCR(FLAG)               (*(uint32_t*)0x40016c64 &= FLAG)
#define Clr_DSI_DSI_LCCR(FLAG)               (*(uint32_t*)0x40016c64 |= ~FLAG)
#define Set_DSI_DSI_CMCR(FLAG)               (*(uint32_t*)0x40016c68 &= FLAG)
#define Clr_DSI_DSI_CMCR(FLAG)               (*(uint32_t*)0x40016c68 |= ~FLAG)
#define Set_DSI_DSI_GHCR(FLAG)               (*(uint32_t*)0x40016c6c &= FLAG)
#define Clr_DSI_DSI_GHCR(FLAG)               (*(uint32_t*)0x40016c6c |= ~FLAG)
#define Set_DSI_DSI_GPDR(FLAG)               (*(uint32_t*)0x40016c70 &= FLAG)
#define Clr_DSI_DSI_GPDR(FLAG)               (*(uint32_t*)0x40016c70 |= ~FLAG)
#define Set_DSI_DSI_GPSR(FLAG)               (*(uint32_t*)0x40016c74 &= FLAG)
#define Clr_DSI_DSI_GPSR(FLAG)               (*(uint32_t*)0x40016c74 |= ~FLAG)
#define Set_DSI_DSI_TCCR0(FLAG)              (*(uint32_t*)0x40016c78 &= FLAG)
#define Clr_DSI_DSI_TCCR0(FLAG)              (*(uint32_t*)0x40016c78 |= ~FLAG)
#define Set_DSI_DSI_TCCR1(FLAG)              (*(uint32_t*)0x40016c7c &= FLAG)
#define Clr_DSI_DSI_TCCR1(FLAG)              (*(uint32_t*)0x40016c7c |= ~FLAG)
#define Set_DSI_DSI_TCCR2(FLAG)              (*(uint32_t*)0x40016c80 &= FLAG)
#define Clr_DSI_DSI_TCCR2(FLAG)              (*(uint32_t*)0x40016c80 |= ~FLAG)
#define Set_DSI_DSI_TCCR3(FLAG)              (*(uint32_t*)0x40016c84 &= FLAG)
#define Clr_DSI_DSI_TCCR3(FLAG)              (*(uint32_t*)0x40016c84 |= ~FLAG)
#define Set_DSI_DSI_TCCR4(FLAG)              (*(uint32_t*)0x40016c88 &= FLAG)
#define Clr_DSI_DSI_TCCR4(FLAG)              (*(uint32_t*)0x40016c88 |= ~FLAG)
#define Set_DSI_DSI_TCCR5(FLAG)              (*(uint32_t*)0x40016c8c &= FLAG)
#define Clr_DSI_DSI_TCCR5(FLAG)              (*(uint32_t*)0x40016c8c |= ~FLAG)
#define Set_DSI_DSI_CLCR(FLAG)               (*(uint32_t*)0x40016c94 &= FLAG)
#define Clr_DSI_DSI_CLCR(FLAG)               (*(uint32_t*)0x40016c94 |= ~FLAG)
#define Set_DSI_DSI_CLTCR(FLAG)              (*(uint32_t*)0x40016c98 &= FLAG)
#define Clr_DSI_DSI_CLTCR(FLAG)              (*(uint32_t*)0x40016c98 |= ~FLAG)
#define Set_DSI_DSI_DLTCR(FLAG)              (*(uint32_t*)0x40016c9c &= FLAG)
#define Clr_DSI_DSI_DLTCR(FLAG)              (*(uint32_t*)0x40016c9c |= ~FLAG)
#define Set_DSI_DSI_PCTLR(FLAG)              (*(uint32_t*)0x40016ca0 &= FLAG)
#define Clr_DSI_DSI_PCTLR(FLAG)              (*(uint32_t*)0x40016ca0 |= ~FLAG)
#define Set_DSI_DSI_PCONFR(FLAG)             (*(uint32_t*)0x40016ca4 &= FLAG)
#define Clr_DSI_DSI_PCONFR(FLAG)             (*(uint32_t*)0x40016ca4 |= ~FLAG)
#define Set_DSI_DSI_PUCR(FLAG)               (*(uint32_t*)0x40016ca8 &= FLAG)
#define Clr_DSI_DSI_PUCR(FLAG)               (*(uint32_t*)0x40016ca8 |= ~FLAG)
#define Set_DSI_DSI_PTTCR(FLAG)              (*(uint32_t*)0x40016cac &= FLAG)
#define Clr_DSI_DSI_PTTCR(FLAG)              (*(uint32_t*)0x40016cac |= ~FLAG)
#define Set_DSI_DSI_PSR(FLAG)                (*(uint32_t*)0x40016cb0 &= FLAG)
#define Clr_DSI_DSI_PSR(FLAG)                (*(uint32_t*)0x40016cb0 |= ~FLAG)
#define Set_DSI_DSI_ISR0(FLAG)               (*(uint32_t*)0x40016cbc &= FLAG)
#define Clr_DSI_DSI_ISR0(FLAG)               (*(uint32_t*)0x40016cbc |= ~FLAG)
#define Set_DSI_DSI_ISR1(FLAG)               (*(uint32_t*)0x40016cc0 &= FLAG)
#define Clr_DSI_DSI_ISR1(FLAG)               (*(uint32_t*)0x40016cc0 |= ~FLAG)
#define Set_DSI_DSI_IER0(FLAG)               (*(uint32_t*)0x40016cc4 &= FLAG)
#define Clr_DSI_DSI_IER0(FLAG)               (*(uint32_t*)0x40016cc4 |= ~FLAG)
#define Set_DSI_DSI_IER1(FLAG)               (*(uint32_t*)0x40016cc8 &= FLAG)
#define Clr_DSI_DSI_IER1(FLAG)               (*(uint32_t*)0x40016cc8 |= ~FLAG)
#define Set_DSI_DSI_FIR0(FLAG)               (*(uint32_t*)0x40016cd8 &= FLAG)
#define Clr_DSI_DSI_FIR0(FLAG)               (*(uint32_t*)0x40016cd8 |= ~FLAG)
#define Set_DSI_DSI_FIR1(FLAG)               (*(uint32_t*)0x40016cdc &= FLAG)
#define Clr_DSI_DSI_FIR1(FLAG)               (*(uint32_t*)0x40016cdc |= ~FLAG)
#define Set_DSI_DSI_VSCR(FLAG)               (*(uint32_t*)0x40016d00 &= FLAG)
#define Clr_DSI_DSI_VSCR(FLAG)               (*(uint32_t*)0x40016d00 |= ~FLAG)
#define Set_DSI_DSI_LCVCIDR(FLAG)            (*(uint32_t*)0x40016d0c &= FLAG)
#define Clr_DSI_DSI_LCVCIDR(FLAG)            (*(uint32_t*)0x40016d0c |= ~FLAG)
#define Set_DSI_DSI_LCCCR(FLAG)              (*(uint32_t*)0x40016d10 &= FLAG)
#define Clr_DSI_DSI_LCCCR(FLAG)              (*(uint32_t*)0x40016d10 |= ~FLAG)
#define Set_DSI_DSI_LPMCCR(FLAG)             (*(uint32_t*)0x40016d18 &= FLAG)
#define Clr_DSI_DSI_LPMCCR(FLAG)             (*(uint32_t*)0x40016d18 |= ~FLAG)
#define Set_DSI_DSI_VMCCR(FLAG)              (*(uint32_t*)0x40016d38 &= FLAG)
#define Clr_DSI_DSI_VMCCR(FLAG)              (*(uint32_t*)0x40016d38 |= ~FLAG)
#define Set_DSI_DSI_VPCCR(FLAG)              (*(uint32_t*)0x40016d3c &= FLAG)
#define Clr_DSI_DSI_VPCCR(FLAG)              (*(uint32_t*)0x40016d3c |= ~FLAG)
#define Set_DSI_DSI_VCCCR(FLAG)              (*(uint32_t*)0x40016d40 &= FLAG)
#define Clr_DSI_DSI_VCCCR(FLAG)              (*(uint32_t*)0x40016d40 |= ~FLAG)
#define Set_DSI_DSI_VNPCCR(FLAG)             (*(uint32_t*)0x40016d44 &= FLAG)
#define Clr_DSI_DSI_VNPCCR(FLAG)             (*(uint32_t*)0x40016d44 |= ~FLAG)
#define Set_DSI_DSI_VHSACCR(FLAG)            (*(uint32_t*)0x40016d48 &= FLAG)
#define Clr_DSI_DSI_VHSACCR(FLAG)            (*(uint32_t*)0x40016d48 |= ~FLAG)
#define Set_DSI_DSI_VHBPCCR(FLAG)            (*(uint32_t*)0x40016d4c &= FLAG)
#define Clr_DSI_DSI_VHBPCCR(FLAG)            (*(uint32_t*)0x40016d4c |= ~FLAG)
#define Set_DSI_DSI_VLCCR(FLAG)              (*(uint32_t*)0x40016d50 &= FLAG)
#define Clr_DSI_DSI_VLCCR(FLAG)              (*(uint32_t*)0x40016d50 |= ~FLAG)
#define Set_DSI_DSI_VVSACCR(FLAG)            (*(uint32_t*)0x40016d54 &= FLAG)
#define Clr_DSI_DSI_VVSACCR(FLAG)            (*(uint32_t*)0x40016d54 |= ~FLAG)
#define Set_DSI_DSI_VVBPCCR(FLAG)            (*(uint32_t*)0x40016d58 &= FLAG)
#define Clr_DSI_DSI_VVBPCCR(FLAG)            (*(uint32_t*)0x40016d58 |= ~FLAG)
#define Set_DSI_DSI_VVFPCCR(FLAG)            (*(uint32_t*)0x40016d5c &= FLAG)
#define Clr_DSI_DSI_VVFPCCR(FLAG)            (*(uint32_t*)0x40016d5c |= ~FLAG)
#define Set_DSI_DSI_VVACCR(FLAG)             (*(uint32_t*)0x40016d60 &= FLAG)
#define Clr_DSI_DSI_VVACCR(FLAG)             (*(uint32_t*)0x40016d60 |= ~FLAG)
#define Set_DSI_DSI_WCFGR(FLAG)              (*(uint32_t*)0x40017000 &= FLAG)
#define Clr_DSI_DSI_WCFGR(FLAG)              (*(uint32_t*)0x40017000 |= ~FLAG)
#define Set_DSI_DSI_WCR(FLAG)                (*(uint32_t*)0x40017004 &= FLAG)
#define Clr_DSI_DSI_WCR(FLAG)                (*(uint32_t*)0x40017004 |= ~FLAG)
#define Set_DSI_DSI_WIER(FLAG)               (*(uint32_t*)0x40017008 &= FLAG)
#define Clr_DSI_DSI_WIER(FLAG)               (*(uint32_t*)0x40017008 |= ~FLAG)
#define Set_DSI_DSI_WISR(FLAG)               (*(uint32_t*)0x4001700c &= FLAG)
#define Clr_DSI_DSI_WISR(FLAG)               (*(uint32_t*)0x4001700c |= ~FLAG)
#define Set_DSI_DSI_WIFCR(FLAG)              (*(uint32_t*)0x40017010 &= FLAG)
#define Clr_DSI_DSI_WIFCR(FLAG)              (*(uint32_t*)0x40017010 |= ~FLAG)
#define Set_DSI_DSI_WPCR1(FLAG)              (*(uint32_t*)0x40017018 &= FLAG)
#define Clr_DSI_DSI_WPCR1(FLAG)              (*(uint32_t*)0x40017018 |= ~FLAG)
#define Set_DSI_DSI_WPCR2(FLAG)              (*(uint32_t*)0x4001701c &= FLAG)
#define Clr_DSI_DSI_WPCR2(FLAG)              (*(uint32_t*)0x4001701c |= ~FLAG)
#define Set_DSI_DSI_WPCR3(FLAG)              (*(uint32_t*)0x40017020 &= FLAG)
#define Clr_DSI_DSI_WPCR3(FLAG)              (*(uint32_t*)0x40017020 |= ~FLAG)
#define Set_DSI_DSI_WPCR4(FLAG)              (*(uint32_t*)0x40017024 &= FLAG)
#define Clr_DSI_DSI_WPCR4(FLAG)              (*(uint32_t*)0x40017024 |= ~FLAG)
#define Set_DSI_DSI_WPCR5(FLAG)              (*(uint32_t*)0x40017028 &= FLAG)
#define Clr_DSI_DSI_WPCR5(FLAG)              (*(uint32_t*)0x40017028 |= ~FLAG)
#define Set_DSI_DSI_WRPCR(FLAG)              (*(uint32_t*)0x40017030 &= FLAG)
#define Clr_DSI_DSI_WRPCR(FLAG)              (*(uint32_t*)0x40017030 |= ~FLAG)
#define  _DSI_DSI_VR_VERSION                                 (0xffffffff << 0)    // Version of the DSI Host
#define  _DSI_DSI_CR_EN                                      (0x1 << 0)    // Enable
#define  _DSI_DSI_CCR_TXECKDIV                               (0xff << 0)    // TX Escape Clock Division
#define  _DSI_DSI_CCR_TOCKDIV                                (0xff << 8)    // Timeout Clock Division
#define  _DSI_DSI_LVCIDR_VCID                                (0x3 << 0)    // Virtual Channel ID
#define  _DSI_DSI_LCOLCR_COLC                                (0xf << 0)    // Color Coding
#define  _DSI_DSI_LCOLCR_LPE                                 (0x1 << 8)    // Loosely Packet Enable
#define  _DSI_DSI_LPCR_DEP                                   (0x1 << 0)    // Data Enable Polarity
#define  _DSI_DSI_LPCR_VSP                                   (0x1 << 1)    // VSYNC Polarity
#define  _DSI_DSI_LPCR_HSP                                   (0x1 << 2)    // HSYNC Polarity
#define  _DSI_DSI_LPMCR_VLPSIZE                              (0xff << 0)    // VACT Largest Packet Size
#define  _DSI_DSI_LPMCR_LPSIZE                               (0xff << 16)    // Largest Packet Size
#define  _DSI_DSI_PCR_ETTXE                                  (0x1 << 0)    // EoTp Transmission Enable
#define  _DSI_DSI_PCR_ETRXE                                  (0x1 << 1)    // EoTp Reception Enable
#define  _DSI_DSI_PCR_BTAE                                   (0x1 << 2)    // Bus Turn Around Enable
#define  _DSI_DSI_PCR_ECCRXE                                 (0x1 << 3)    // ECC Reception Enable
#define  _DSI_DSI_PCR_CRCRXE                                 (0x1 << 4)    // CRC Reception Enable
#define  _DSI_DSI_GVCIDR_VCID                                (0x3 << 0)    // Virtual Channel ID
#define  _DSI_DSI_MCR_CMDM                                   (0x1 << 0)    // Command mode
#define  _DSI_DSI_VMCR_VMT                                   (0x3 << 0)    // Video mode Type
#define  _DSI_DSI_VMCR_LPVSAE                                (0x1 << 8)    // Low-Power Vertical Sync Active Enable
#define  _DSI_DSI_VMCR_LPVBPE                                (0x1 << 9)    // Low-power Vertical Back-Porch Enable
#define  _DSI_DSI_VMCR_LPVFPE                                (0x1 << 10)    // Low-power Vertical Front-porch Enable
#define  _DSI_DSI_VMCR_LPVAE                                 (0x1 << 11)    // Low-Power Vertical Active Enable
#define  _DSI_DSI_VMCR_LPHBPE                                (0x1 << 12)    // Low-Power Horizontal Back-Porch Enable
#define  _DSI_DSI_VMCR_LPHFPE                                (0x1 << 13)    // Low-Power Horizontal Front-Porch Enable
#define  _DSI_DSI_VMCR_FBTAAE                                (0x1 << 14)    // Frame Bus-Turn-Around Acknowledge Enable
#define  _DSI_DSI_VMCR_LPCE                                  (0x1 << 15)    // Low-Power Command Enable
#define  _DSI_DSI_VMCR_PGE                                   (0x1 << 16)    // Pattern Generator Enable
#define  _DSI_DSI_VMCR_PGM                                   (0x1 << 20)    // Pattern Generator mode
#define  _DSI_DSI_VMCR_PGO                                   (0x1 << 24)    // Pattern Generator Orientation
#define  _DSI_DSI_VPCR_VPSIZE                                (0x3fff << 0)    // Video Packet Size
#define  _DSI_DSI_VCCR_NUMC                                  (0x1fff << 0)    // Number of Chunks
#define  _DSI_DSI_VNPCR_NPSIZE                               (0x1fff << 0)    // Null Packet Size
#define  _DSI_DSI_VHSACR_HSA                                 (0xfff << 0)    // Horizontal Synchronism Active duration
#define  _DSI_DSI_VHBPCR_HBP                                 (0xfff << 0)    // Horizontal Back-Porch duration
#define  _DSI_DSI_VLCR_HLINE                                 (0x7fff << 0)    // Horizontal Line duration
#define  _DSI_DSI_VVSACR_VSA                                 (0x3ff << 0)    // Vertical Synchronism Active duration
#define  _DSI_DSI_VVBPCR_VBP                                 (0x3ff << 0)    // Vertical Back-Porch duration
#define  _DSI_DSI_VVFPCR_VFP                                 (0x3ff << 0)    // Vertical Front-Porch duration
#define  _DSI_DSI_VVACR_VA                                   (0x3fff << 0)    // Vertical Active duration
#define  _DSI_DSI_LCCR_CMDSIZE                               (0xffff << 0)    // Command Size
#define  _DSI_DSI_CMCR_TEARE                                 (0x1 << 0)    // Tearing Effect Acknowledge Request Enable
#define  _DSI_DSI_CMCR_ARE                                   (0x1 << 1)    // Acknowledge Request Enable
#define  _DSI_DSI_CMCR_GSW0TX                                (0x1 << 8)    // Generic Short Write Zero parameters Transmission
#define  _DSI_DSI_CMCR_GSW1TX                                (0x1 << 9)    // Generic Short Write One parameters Transmission
#define  _DSI_DSI_CMCR_GSW2TX                                (0x1 << 10)    // Generic Short Write Two parameters Transmission
#define  _DSI_DSI_CMCR_GSR0TX                                (0x1 << 11)    // Generic Short Read Zero parameters Transmission
#define  _DSI_DSI_CMCR_GSR1TX                                (0x1 << 12)    // Generic Short Read One parameters Transmission
#define  _DSI_DSI_CMCR_GSR2TX                                (0x1 << 13)    // Generic Short Read Two parameters Transmission
#define  _DSI_DSI_CMCR_GLWTX                                 (0x1 << 14)    // Generic Long Write Transmission
#define  _DSI_DSI_CMCR_DSW0TX                                (0x1 << 16)    // DCS Short Write Zero parameter Transmission
#define  _DSI_DSI_CMCR_DSW1TX                                (0x1 << 17)    // DCS Short Read One parameter Transmission
#define  _DSI_DSI_CMCR_DSR0TX                                (0x1 << 18)    // DCS Short Read Zero parameter Transmission
#define  _DSI_DSI_CMCR_DLWTX                                 (0x1 << 19)    // DCS Long Write Transmission
#define  _DSI_DSI_CMCR_MRDPS                                 (0x1 << 24)    // Maximum Read Packet Size
#define  _DSI_DSI_GHCR_DT                                    (0x3f << 0)    // Type
#define  _DSI_DSI_GHCR_VCID                                  (0x3 << 6)    // Channel
#define  _DSI_DSI_GHCR_WCLSB                                 (0xff << 8)    // WordCount LSB
#define  _DSI_DSI_GHCR_WCMSB                                 (0xff << 16)    // WordCount MSB
#define  _DSI_DSI_GPDR_DATA1                                 (0xff << 0)    // Payload Byte 1
#define  _DSI_DSI_GPDR_DATA2                                 (0xff << 8)    // Payload Byte 2
#define  _DSI_DSI_GPDR_DATA3                                 (0xff << 16)    // Payload Byte 3
#define  _DSI_DSI_GPDR_DATA4                                 (0xff << 24)    // Payload Byte 4
#define  _DSI_DSI_GPSR_CMDFE                                 (0x1 << 0)    // Command FIFO Empty
#define  _DSI_DSI_GPSR_CMDFF                                 (0x1 << 1)    // Command FIFO Full
#define  _DSI_DSI_GPSR_PWRFE                                 (0x1 << 2)    // Payload Write FIFO Empty
